# -*- eval: (org-babel-lob-ingest "./ob-haskell-common.org"); -*-

#+TITLE: Types

#+PROPERTY: header-args:haskell :results replace output
#+PROPERTY: header-args:haskell+ :noweb yes
#+PROPERTY: header-args:haskell+ :wrap EXAMPLE
#+PROPERTY: header-args:haskell+ :epilogue ":load"
#+PROPERTY: header-args:haskell+ :post ghci-clean(content=*this*)

* 5.03 How to read type signatures
With numbers we see type class information (type class constraints)
and not concrete types, so that we can use the data (ex. ~13~) in
multiple computations and not only where ~Int~ or ~Integer~ are
required.

#+BEGIN_SRC haskell
:t 13
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
13 :: Num p => p
#+END_EXAMPLE

But if we declare the number with a concrete type then

#+BEGIN_SRC haskell
x = 13 :: Integer
:t x
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
x :: Integer
#+END_EXAMPLE

We can also query signature of functions

#+BEGIN_SRC haskell
:t not
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
not :: Bool -> Bool
#+END_EXAMPLE

** Understanding the function type
The arrow is a /Type Constructor/ backed into the language, it takes
arguments and has no /Data Constructor/

#+BEGIN_SRC haskell
:i (->)
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
data (->) (a :: TYPE q) (b :: TYPE r) 	-- Defined in ‘GHC.Prim’
infixr 0 ->
instance Applicative ((->) a) -- Defined in ‘GHC.Base’
instance Functor ((->) r) -- Defined in ‘GHC.Base’
instance Monad ((->) r) -- Defined in ‘GHC.Base’
Monoid (a -> b) -- Defined in ‘GHC.Base’
Semigroup (a -> b) -- Defined in ‘GHC.Base’
#+END_EXAMPLE

Function type has no /Data Constructors/. The values that shows up at
term level is the function. Functions are values.

~(->)~ is right associative, it means that ~(+) :: a -> a -> a~ takes
an ~a~ and returns a ~(a -> a)~

When a /Type Class/ is constraining a /Type Variable/, the variable
can represent one of the types that have instances of that /Type
Class/. When we constrain a /Type Variable/ like ~Num a => a -> a~
means also that the first and the second argument must be of the same
concrete type when found.

A type signature can have more than one /Type Class/ constraint like
#+BEGIN_SRC haskell :eval never
(Ord a, Num a) => a -> a -> Ordering
#+END_SRC

Look up [[https://wiki.haskell.org/Keywords][here]] to learn the keywords of the language.

Application is evaluation; in other words, the only way to evaluate
anything is by applying functions, and function application is left
associative, means that the left most arguments are evaluated first.

** Partial Application
#+BEGIN_SRC haskell
:{
addFive :: Integer -> Integer -> Integer
addFive a b = a + b + 5
:}
:t addFive

addTen = addFive 5
:t addTen

fifteen = addTen 5
:t fifteen

fifteen
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
addFive :: Integer -> Integer -> Integer
addTen :: Integer -> Integer
fifteen :: Integer
15
#+END_EXAMPLE

** Sectioning
Specifically refers to partial application of infix operators, which
has a special syntax and allows you to choose whether the argument
you're applying the operator to is the first or the second.

#+BEGIN_SRC haskell
x = 5
y = (2^)
z = (^2)

y x
z x
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
32
25
#+END_EXAMPLE

** Polymorphic Constants
Some constants / values can be polymorphic aka their concrete type can
be left to be decided

#+BEGIN_SRC haskell
:t [] -- parametric
:t 1  -- constrained
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
[] -- parametric :: [a]
1  -- constrained :: Num p => p
#+END_EXAMPLE

Sometimes we have a value with a concrete type but we would like to
have a polymorphic value to be used in more context

#+BEGIN_SRC haskell
-- 6 / length([1, 2, 3])
-- raise an error because length give us an Int an (/) pretends a Fractional
:t length
:t (/)
-- we can use fromIntegral
:t fromIntegral
-- which turns an Integral value in a Num value
6 / fromIntegral(length([1, 2, 3]))
6 / (fromIntegral . length) [1, 2, 3]
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
length :: Foldable t => t a -> Int
(/) :: Fractional a => a -> a -> a
fromIntegral :: (Integral a, Num b) => a -> b
2.0
2.0
#+END_EXAMPLE

* 5.07 Asserting Types for Declaration
You can enforce types of things by explicitly declaring them. Adding
type signatures to your code can provide guidance to you as you write
your functions.

#+BEGIN_SRC haskell
triple x = x * 3
:t triple

-- With type declaration
triple' x = x * 3 :: Integer
:t triple'
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
triple :: Num a => a -> a
triple' :: Integer -> Integer
#+END_EXAMPLE

Another way is to explicitly declare the type of the function
#+BEGIN_SRC haskell
:{
-- Type Declaration
triple :: Integer -> Integer
-- Function Declaration
triple x = x * 3
:}

:t triple
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
triple :: Integer -> Integer
#+END_EXAMPLE

This is how most Haskell code you look at will be laid out, with
separate top-level declarations for types and functions. Such top-
level declarations are in scope throughout the module.

It is possible to assert type locally with ~let~ and ~where~
#+BEGIN_SRC haskell
:{
triple x = f x
  where f :: Integer -> Integer
        f x = x * 3
:}

:t triple
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
triple :: Integer -> Integer
#+END_EXAMPLE

** Fix it
Won’t someone take pity on this poor broken code and fix it up? Be
sure to check carefully for things like capitalization, parentheses,
and indentation.

1. Make it compile
   #+BEGIN_SRC haskell :tangle chapter-005/SingFirst.hs :epilogue ""
   module SingFirst where

   fstString :: [Char] -> [Char]
   fstString x = x ++ " in the rain"

   sndString :: [Char] -> [Char]
   sndString x = x ++ " over the rainbow"

   sing = if (x < y) then fstString x else sndString y
     where
       x = "Singin"
       y = "Somewhere"
   #+END_SRC

   #+BEGIN_SRC haskell
   <<add-chapter-directory-in-path(chapter="chapter-005")>>
   :l SingFirst
   sing
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   Singin in the rain
   #+END_EXAMPLE

2. Make it sing the other song
   #+BEGIN_SRC haskell :tangle chapter-005/SingSecond.hs :epilogue ""
   module SingSecond where

   fstString :: [Char] -> [Char]
   fstString x = x ++ " in the rain"

   sndString :: [Char] -> [Char]
   sndString x = x ++ " over the rainbow"

   sing = if (x > y) then fstString x else sndString y
     where
       x = "Singin"
       y = "Somewhere"
   #+END_SRC

   #+BEGIN_SRC haskell
   <<add-chapter-directory-in-path(chapter="chapter-005")>>
   :l SingSecond
   sing
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   Somewhere over the rainbow
   #+END_EXAMPLE

3. Make it compile
   #+BEGIN_SRC haskell :tangle chapter-005/Arith3Broken.hs :epilogue ""
   module Arith3Broken where

   main :: IO ()
   main = do
     print (1 + 2)
     putStrLn (show 10)
     print (negate (-1))
     print ((+) 0 blah) where blah = negate 1
   #+END_SRC

   #+BEGIN_SRC haskell
   <<add-chapter-directory-in-path(chapter="chapter-005")>>
   :l Arith3Broken
   main
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   3
   10
   1
   -1
   #+END_EXAMPLE

